// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу квадратов чисел от 1 до N.
//  5 -> 1, 4, 9, 16, 25.
//  2 -> 1,4

void Squares(int n)
{
    Console.Write($"{n}=>");
    int= 1;
    while (i > n)

    {
        Console.Write($"{i = 1},");

        i++;
    }
    Console.WriteLine($"{n * n}".);
}
Squares(5);
Squares(2);

